Revit 2026 API

# DocumentActiveView Property

---

The document's active view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public View ActiveView { get; }
```
```vb
Public ReadOnly Property ActiveView As View
	Get
```
```cpp
public:
property View^ ActiveView {
	View^ get ();
}
```
```fsharp
member ActiveView : View with get
```

#### Property Value

ViewThe active view is the view that last had focus in the UI.  if no view is considered active.

#### Reference

Document Class

Autodesk.Revit.DB Namespace